Repository: xcv58/MacTools
Catalog: Plugins/AutoInput/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, zh_hant

# error.persistenceFailed
source: 无法保存自动切换输入法设置。
ar: تعذر حفظ إعدادات التبديل التلقائي لمصدر الإدخال.
de: Die Einstellungen für den automatischen Eingabequellenwechsel konnten nicht gesichert werden.
en: Unable to save automatic input source settings.
es: No se han podido guardar los ajustes de cambio automático de fuente de entrada.
fr: Impossible d’enregistrer les réglages de changement automatique de source de saisie.
ja: 入力ソースの自動切り替え設定を保存できませんでした。
ko: 자동 입력 소스 전환 설정을 저장할 수 없습니다.
pt: Não foi possível salvar os ajustes de troca automática da fonte de entrada.
ru: Не удалось сохранить настройки автоматического переключения источника ввода.
zh_hant: 無法儲存自動切換輸入法設定。

# error.persistenceRollbackFailed
source: 无法保存自动切换输入法设置，且恢复先前设置失败。
ar: تعذر حفظ إعدادات التبديل التلقائي لمصدر الإدخال، كما تعذرت استعادة الإعدادات السابقة.
de: Die Einstellungen konnten nicht gesichert und die vorherigen Einstellungen nicht wiederhergestellt werden.
en: Unable to save automatic input source settings or restore the previous settings.
es: No se han podido guardar los ajustes ni restaurar los anteriores.
fr: Impossible d’enregistrer les réglages et de restaurer les précédents.
ja: 入力ソース設定を保存できず、以前の設定も復元できませんでした。
ko: 입력 소스 설정을 저장하거나 이전 설정을 복원할 수 없습니다.
pt: Não foi possível salvar os ajustes nem restaurar os anteriores.
ru: Не удалось сохранить настройки и восстановить предыдущие.
zh_hant: 無法儲存自動切換輸入法設定，且無法還原先前設定。

# action.disable.title
source: 暂停自动切换输入法
ar: إيقاف تبديل الإدخال التلقائي مؤقتًا
de: Automatischen Eingabewechsel pausieren
en: Pause Auto Input
es: Pausar cambio automático de entrada
fr: Suspendre le changement automatique
ja: 入力の自動切り替えを一時停止
ko: 입력 자동 전환 일시 정지
pt: Pausar troca automática de entrada
ru: Приостановить автопереключение ввода
zh_hant: 暫停自動切換輸入法

# action.enable.title
source: 开启自动切换输入法
ar: تشغيل تبديل الإدخال التلقائي
de: Automatischen Eingabewechsel aktivieren
en: Turn On Auto Input
es: Activar cambio automático de entrada
fr: Activer le changement automatique
ja: 入力の自動切り替えをオン
ko: 입력 자동 전환 켜기
pt: Ativar troca automática de entrada
ru: Включить автопереключение ввода
zh_hant: 開啟自動切換輸入法

# action.selectSource.definitionTitle
source: 选择输入法
ar: اختيار مصدر إدخال
de: Eingabequelle auswählen
en: Select Input Source
es: Seleccionar fuente de entrada
fr: Sélectionner la source de saisie
ja: 入力ソースを選択
ko: 입력 소스 선택
pt: Selecionar fonte de entrada
ru: Выбрать источник ввода
zh_hant: 選擇輸入法

# action.selectSource.description
source: 直接切换到指定输入法。
ar: التبديل مباشرةً إلى مصدر إدخال محدد.
de: Direkt zu einer bestimmten Eingabequelle wechseln.
en: Switch directly to a specific input source.
es: Cambiar directamente a una fuente de entrada específica.
fr: Passer directement à une source de saisie précise.
ja: 指定した入力ソースに直接切り替えます。
ko: 지정한 입력 소스로 바로 전환합니다.
pt: Alterne diretamente para uma fonte de entrada específica.
ru: Переключиться непосредственно на выбранный источник ввода.
zh_hant: 直接切換到指定輸入法。

# action.selectSource.parameterTitle
source: 输入法
ar: مصدر الإدخال
de: Eingabequelle
en: Input Source
es: Fuente de entrada
fr: Source de saisie
ja: 入力ソース
ko: 입력 소스
pt: Fonte de entrada
ru: Источник ввода
zh_hant: 輸入法

# action.selectSource.titleFormat
source: 切换到 %@
ar: التبديل إلى %@
de: Zu %@ wechseln
en: Switch to %@
es: Cambiar a %@
fr: Passer à %@
ja: %@に切り替える
ko: %@(으)로 전환
pt: Alternar para %@
ru: Переключиться на %@
zh_hant: 切換到 %@

# action.selectSource.unavailable
source: 输入法已停用或不可用。
ar: مصدر الإدخال معطّل أو غير متاح.
de: Die Eingabequelle ist deaktiviert oder nicht verfügbar.
en: The input source is disabled or unavailable.
es: La fuente de entrada está desactivada o no está disponible.
fr: La source de saisie est désactivée ou indisponible.
ja: 入力ソースが無効になっているか、利用できません。
ko: 입력 소스가 비활성화되었거나 사용할 수 없습니다.
pt: A fonte de entrada está desativada ou indisponível.
ru: Источник ввода отключен или недоступен.
zh_hant: 輸入法已停用或無法使用。

# error.switchFailed
source: 无法切换输入法
ar: تعذّر تبديل مصدر الإدخال
de: Eingabequelle konnte nicht gewechselt werden
en: Unable to switch input source
es: No se pudo cambiar la fuente de entrada
fr: Impossible de changer la source de saisie
ja: 入力ソースを切り替えられません
ko: 입력 소스를 전환할 수 없습니다
pt: Não foi possível alternar a fonte de entrada
ru: Не удалось переключить источник ввода
zh_hant: 無法切換輸入法

# metadata.title
source: 自动切换输入法
ar: تبديل مصادر الإدخال تلقائيًا
de: Eingabequelle automatisch wechseln
en: Auto Input
es: Cambio automático de entrada
fr: Changement automatique de saisie
ja: 入力ソースの自動切り替え
ko: 입력 소스 자동 전환
pt: Troca automática de entrada
ru: Автопереключение источника ввода
zh_hant: 自動切換輸入法

# metadata.description
source: 按应用记住并自动切换输入法
ar: تذكّر مصادر الإدخال وبدّلها تلقائيًا لكل تطبيق.
de: Eingabequellen pro App merken und automatisch wechseln.
en: Remember and automatically switch input sources for each app
es: Recuerde y cambie automáticamente las fuentes de entrada de cada app.
fr: Mémorisez et changez automatiquement la source de saisie pour chaque app.
ja: アプリごとに入力ソースを記憶して自動的に切り替えます。
ko: 앱별 입력 소스를 기억하고 자동으로 전환합니다.
pt: Lembre e alterne automaticamente as fontes de entrada de cada app.
ru: Запоминайте и автоматически переключайте источники ввода для приложений.
zh_hant: 按應用程式記住並自動切換輸入法

# panel.subtitle.paused
source: 已暂停
ar: متوقف مؤقتًا
de: Pausiert
en: Paused
es: En pausa
fr: En pause
ja: 一時停止中
ko: 일시 정지됨
pt: Em pausa
ru: Приостановлено
zh_hant: 已暫停

# panel.subtitle.rulesFormat
source: %d 条固定规则
ar: %d من القواعد الثابتة
de: %d feste Regeln
en: %d fixed rules
es: %d reglas fijas
fr: %d règles fixes
ja: 固定ルール %d 件
ko: 고정 규칙 %d개
pt: %d regras fixas
ru: Фиксированных правил: %d
zh_hant: %d 條固定規則

# panel.subtitle.remembering
source: 自动记忆已开启
ar: تذكّر التطبيقات مفعّل
de: App-Erinnerung ist aktiviert
en: App memory is on
es: Memoria por app activada
fr: Mémorisation par app activée
ja: アプリごとの記憶はオンです
ko: 앱별 기억이 켜져 있음
pt: Memória por app ativada
ru: Запоминание для приложений включено
zh_hant: 自動記憶已開啟

# panel.subtitle.noRules
source: 暂无切换规则
ar: لا توجد قواعد تبديل
de: Keine Wechselregeln
en: No switching rules
es: No hay reglas de cambio
fr: Aucune règle de changement
ja: 切り替えルールなし
ko: 전환 규칙 없음
pt: Nenhuma regra de alternância
ru: Нет правил переключения
zh_hant: 暫無切換規則

# settings.behavior.title
source: 切换行为
ar: سلوك التبديل
de: Wechselverhalten
en: Switching Behavior
es: Comportamiento de cambio
fr: Comportement de changement
ja: 切り替え動作
ko: 전환 동작
pt: Comportamento de alternância
ru: Поведение переключения
zh_hant: 切換行為

# settings.shortcuts.title
source: 输入法快捷键
ar: اختصارات مصادر الإدخال
de: Eingabequellen-Kurzbefehle
en: Input Source Shortcuts
es: Atajos de fuente de entrada
fr: Raccourcis de source de saisie
ja: 入力ソースのショートカット
ko: 입력 소스 단축키
pt: Atalhos de fonte de entrada
ru: Сочетания клавиш источников ввода
zh_hant: 輸入法快速鍵

# settings.shortcuts.description
source: 为常用输入法分配全局快捷键，按下即可直接切换。
ar: عيّن اختصارات عامة لمصادر الإدخال المستخدمة كثيرًا وانتقل إليها مباشرة بضغطة مفتاح.
de: Globale Kurzbefehle für häufig verwendete Eingabequellen festlegen und per Tastendruck direkt wechseln.
en: Assign global shortcuts to frequently used input sources and switch directly with a key press.
es: Asigna atajos globales a las fuentes de entrada que más usas y cambia directamente con una tecla.
fr: Attribuez des raccourcis globaux aux sources de saisie fréquentes et changez directement d’une touche.
ja: よく使う入力ソースにグローバルショートカットを割り当て、キー操作ですぐに切り替えます。
ko: 자주 사용하는 입력 소스에 전역 단축키를 지정하고 키 한 번으로 바로 전환합니다.
pt: Atribua atalhos globais às fontes de entrada mais usadas e alterne diretamente com uma tecla.
ru: Назначьте глобальные сочетания клавиш часто используемым источникам ввода и переключайтесь одним нажатием.
zh_hant: 為常用輸入法指派全域快速鍵，按下即可直接切換。

# settings.hud.title
source: 输入法提示
ar: مؤشر مصدر الإدخال
de: Eingabequellenanzeige
en: Input Source HUD
es: Indicador de fuente de entrada
fr: Indicateur de source de saisie
ja: 入力ソース表示
ko: 입력 소스 표시
pt: Indicador de fonte de entrada
ru: Индикатор источника ввода
zh_hant: 輸入法提示

# settings.hud.description
source: 聚焦文本输入区域或终端时，在附近短暂显示当前输入法。需要辅助功能权限。
ar: اعرض مصدر الإدخال الحالي مؤقتًا قرب منطقة إدخال النص أو الطرفية النشطة. يتطلب إذن تسهيلات الاستخدام.
de: Aktuelle Eingabequelle kurz neben dem aktiven Textbereich oder Terminal anzeigen. Benötigt Bedienungshilfen.
en: Briefly show the current input source near the focused text area or terminal. Requires Accessibility.
es: Muestra brevemente la fuente de entrada actual junto al área de texto o terminal activo. Requiere Accesibilidad.
fr: Affiche brièvement la source de saisie près de la zone de texte ou du terminal actif. Nécessite Accessibilité.
ja: フォーカス中のテキスト入力領域またはターミナル付近に現在の入力ソースを一時表示します。アクセシビリティが必要です。
ko: 포커스된 텍스트 입력 영역 또는 터미널 근처에 현재 입력 소스를 잠시 표시합니다. 손쉬운 사용 권한이 필요합니다.
pt: Mostre brevemente a fonte de entrada atual perto da área de texto ou terminal em foco. Requer Acessibilidade.
ru: Кратко показывать текущий источник ввода рядом с активной областью текста или терминалом. Требуется Универсальный доступ.
zh_hant: 聚焦文字輸入區域或終端機時，在附近短暫顯示目前輸入法。需要輔助使用權限。

# settings.hud.size.title
source: 提示大小
ar: حجم المؤشر
de: HUD-Größe
en: HUD Size
es: Tamaño del indicador
fr: Taille de l’indicateur
ja: 表示サイズ
ko: 표시 크기
pt: Tamanho do indicador
ru: Размер индикатора

# settings.hud.size.description
source: 调整提示的文字和面板大小。
ar: اضبط حجم النص ولوحة المؤشر.
de: Text- und Panelgröße des HUD anpassen.
en: Adjust the HUD’s text and panel size.
es: Ajusta el tamaño del texto y del panel.
fr: Ajustez la taille du texte et du panneau.
ja: 表示のテキストとパネルのサイズを調整します。
ko: 표시의 텍스트와 패널 크기를 조절합니다.
pt: Ajuste o tamanho do texto e do painel.
ru: Настройте размер текста и панели.
zh_hant: 調整提示的文字與面板大小。

# settings.hud.size.compact
source: 紧凑
ar: مضغوط
de: Kompakt
en: Compact
es: Compacto
fr: Compact
ja: コンパクト
ko: 컴팩트
pt: Compacto
ru: Компактный
zh_hant: 緊湊

# settings.hud.size.standard
source: 标准
ar: قياسي
de: Standard
en: Standard
es: Estándar
fr: Standard
ja: 標準
ko: 표준
pt: Padrão
ru: Стандартный
zh_hant: 標準

# settings.hud.size.large
source: 大
ar: كبير
de: Groß
en: Large
es: Grande
fr: Grand
ko: 크게
pt: Grande
ru: Большой

# settings.hud.reducedFrequency.title
source: 减少频繁提示
ar: تقليل تكرار عرض المؤشر
de: Häufige HUD-Anzeigen reduzieren
en: Reduce Frequent HUDs
es: Reducir avisos frecuentes
fr: Réduire les affichages fréquents
ja: 頻繁な表示を減らす
ko: 잦은 표시 줄이기
pt: Reduzir avisos frequentes
ru: Реже показывать индикатор
zh_hant: 減少頻繁提示

# settings.hud.reducedFrequency.description
source: 首次聚焦和输入法变化时立即提示。输入法不变时，达到下方任一条件后再次提示。
ar: يظهر فورًا عند أول تركيز وعند تغيير مصدر الإدخال. مع بقاء المصدر نفسه، يعاد التذكير عند بلوغ أحد الحدين أدناه.
de: Beim ersten Fokus und bei Eingabequellenwechseln sofort anzeigen. Bei gleicher Quelle erneut erinnern, sobald einer der Grenzwerte erreicht ist.
en: Show immediately on first focus and source changes. With the same source, remind again when either limit below is reached.
es: Mostrar de inmediato al enfocar por primera vez y al cambiar de fuente. Con la misma fuente, volver a avisar al alcanzar cualquiera de los límites.
fr: Afficher immédiatement au premier focus et lors d’un changement de source. Avec la même source, rappeler dès que l’une des limites est atteinte.
ja: 最初のフォーカス時と入力ソースの変更時はすぐに表示します。同じ入力ソースでは、下のいずれかの条件に達したときに再度表示します。
ko: 처음 초점을 맞출 때와 입력 소스 변경 시 즉시 표시합니다. 입력 소스가 같으면 아래 조건 중 하나에 도달할 때 다시 알립니다.
pt: Mostrar imediatamente no primeiro foco e ao mudar a fonte. Com a mesma fonte, lembrar novamente quando qualquer limite abaixo for atingido.
ru: Сразу показывать при первом фокусе и смене источника. При том же источнике напоминать снова, когда достигнут любой из лимитов ниже.
zh_hant: 首次聚焦和輸入法變化時立即提示。輸入法不變時，達到下方任一條件後再次提示。

# settings.hud.reminderInterval.title
source: 提示间隔
ar: الفاصل الزمني للتذكير
de: Erinnerungsintervall
en: Reminder Interval
es: Intervalo de recordatorio
fr: Intervalle de rappel
ja: 再通知の間隔
ko: 알림 간격
pt: Intervalo de lembrete
ru: Интервал напоминания
zh_hant: 提示間隔

# settings.hud.reminderInterval.description
source: 经过这段时间后，在下一次有效聚焦时再次提示。
ar: أظهر التذكير مجددًا عند التركيز المؤهل التالي بعد انقضاء هذه المدة.
de: Nach Ablauf dieser Zeit beim nächsten geeigneten Fokus erneut anzeigen.
en: Show again on the next eligible focus after this much time passes.
es: Volver a mostrar en el siguiente foco válido una vez transcurrido este tiempo.
fr: Réafficher au prochain focus admissible après ce délai.
ja: この時間が経過した後、次に対象の入力領域へフォーカスしたときに再表示します。
ko: 이 시간이 지나면 다음 유효한 초점에서 다시 표시합니다.
pt: Mostrar novamente no próximo foco válido após este tempo.
ru: Снова показать при следующем подходящем фокусе после этого времени.
zh_hant: 經過這段時間後，在下一次有效聚焦時再次提示。

# settings.hud.reminderInterval.unit
source: 秒
ar: ث
de: Sek.
en: sec
es: s
fr: s
ko: 초
pt: s
ru: с

# settings.hud.appSwitchReminder.title
source: 应用切换提示
ar: التذكير عند تبديل التطبيقات
de: Erinnerung bei App-Wechsel
en: App-Switch Reminder
es: Recordatorio al cambiar de app
fr: Rappel après changement d’app
ja: アプリ切り替え通知
ko: 앱 전환 알림
pt: Lembrete ao trocar de app
ru: Напоминание при смене приложений
zh_hant: 應用程式切換提示

# settings.hud.appSwitchReminder.description
source: 达到此切换次数后，即使尚未到提示间隔，也会在输入区域聚焦时提示。
ar: أظهر التذكير مجددًا بعد هذا العدد من تبديلات التطبيقات، حتى قبل انتهاء المدة.
de: Nach dieser Anzahl von App-Wechseln erneut anzeigen, auch vor Ablauf des Zeitlimits.
en: Show again after this many app switches, even before the time limit.
es: Volver a mostrar tras este número de cambios de app, incluso antes del límite de tiempo.
fr: Réafficher après ce nombre de changements d’app, même avant la limite de temps.
ja: 時間の条件に達する前でも、この回数だけアプリを切り替えると再表示します。
ko: 시간 제한 전이라도 이 횟수만큼 앱을 전환하면 다시 표시합니다.
pt: Mostrar novamente após este número de trocas de app, mesmo antes do limite de tempo.
ru: Снова показать после этого числа переключений приложений, даже до истечения времени.
zh_hant: 達到此切換次數後，即使尚未到提示間隔，也會在輸入區域聚焦時提示。

# settings.hud.appSwitchReminder.unit
source: 次
ar: تبديلات
de: Wechsel
en: switches
es: cambios
fr: changements
ja: 回
ko: 회
pt: trocas
ru: переключения

# settings.hud.interactive.title
source: 交互式提示
ar: مؤشر تفاعلي
de: Interaktives HUD
en: Interactive HUD
es: Indicador interactivo
fr: Indicateur interactif
ja: 操作可能な表示
ko: 대화형 표시
pt: Indicador interativo
ru: Интерактивный индикатор
zh_hant: 互動式提示

# settings.hud.interactive.description
source: 悬停时保持显示；可连续点击循环切换输入法。
ar: يبقى ظاهرًا عند تمرير المؤشر؛ انقر عدة مرات للتنقل بين مصادر الإدخال.
de: Bleibt beim Darüberfahren sichtbar; wiederholt klicken, um durch die Eingabequellen zu wechseln.
en: Stays visible while hovered; click repeatedly to cycle through input sources.
es: Permanece visible al pasar el puntero; haz clic varias veces para recorrer las fuentes de entrada.
fr: Reste visible au survol ; cliquez plusieurs fois pour parcourir les sources de saisie.
ja: ポインタを重ねると表示を維持し、繰り返しクリックして入力ソースを切り替えます。
ko: 포인터를 올려 두면 계속 표시되며, 반복해서 클릭해 입력 소스를 순환합니다.
pt: Permanece visível ao passar o cursor; clique repetidamente para alternar entre as fontes de entrada.
ru: Остаётся видимым при наведении; нажимайте, чтобы переключаться между источниками ввода.
zh_hant: 停留時保持顯示；可連續按一下循環切換輸入法。

# settings.hud.position.title
source: 提示位置
ar: موضع المؤشر
de: HUD-Position
en: HUD Position
es: Posición del indicador
fr: Position de l’indicateur
ja: 表示位置
ko: 표시 위치
pt: Posição do indicador
ru: Положение индикатора

# settings.hud.position.description
source: 选择提示显示在当前输入区域、指针附近或所在显示器中央。
ar: اختر ظهور المؤشر قرب منطقة الإدخال أو عند مؤشر الماوس أو في وسط الشاشة.
de: Wählen, ob das HUD nahe am Eingabebereich, am Zeiger oder in der Mitte des Bildschirms erscheint.
en: Choose whether the HUD appears near the input area, at the pointer, or in the center of the display.
es: Elige si el indicador aparece cerca del área de entrada, en el puntero o en el centro de la pantalla.
fr: Choisissez si l’indicateur apparaît près de la zone de saisie, au pointeur ou au centre de l’écran.
ja: 入力領域の近く、ポインタの位置、または画面中央のどこに表示するかを選択します。
ko: 입력 영역 근처, 포인터 위치 또는 화면 중앙에 표시할지 선택합니다.
pt: Escolha se o indicador aparece perto da área de entrada, no cursor ou no centro da tela.
ru: Выберите, показывать индикатор рядом с областью ввода, у указателя или по центру экрана.
zh_hant: 選擇提示顯示在目前輸入區域、指標附近或所在顯示器中央。

# settings.hud.position.automatic
source: 自动
ar: تلقائي
de: Automatisch
en: Automatic
es: Automático
fr: Automatique
ja: 自動
ko: 자동
pt: Automático
ru: Автоматически
zh_hant: 自動

# settings.hud.position.above
source: 优先显示在上方
ar: يفضّل الأعلى
de: Oben bevorzugen
en: Prefer Above
es: Preferir arriba
fr: Préférer au-dessus
ja: 上を優先
ko: 위쪽 우선
pt: Preferir acima
ru: Предпочитать сверху
zh_hant: 優先顯示在上方

# settings.hud.position.below
source: 优先显示在下方
ar: يفضّل الأسفل
de: Unten bevorzugen
en: Prefer Below
es: Preferir abajo
fr: Préférer au-dessous
ja: 下を優先
ko: 아래쪽 우선
pt: Preferir abaixo
ru: Предпочитать снизу
zh_hant: 優先顯示在下方

# settings.hud.position.screen-center
source: 屏幕中央
ar: وسط الشاشة
de: Bildschirmmitte
en: Center of Screen
es: Centro de la pantalla
fr: Centre de l’écran
ja: 画面中央
ko: 화면 중앙
pt: Centro da tela
ru: По центру экрана
zh_hant: 螢幕中央

# settings.hud.position.at-pointer
source: 指针处
ar: عند مؤشر الماوس
de: Am Zeiger
en: At Pointer
es: En el puntero
fr: Au pointeur
ja: ポインタの位置
ko: 포인터 위치
pt: No cursor
ru: У указателя
zh_hant: 指標處

# settings.hud.position.at-pointer.help
source: 将提示放在指针左上方，指针停在右下角，避免遮挡文字。
ar: يضع شاشة العرض أعلى المؤشر وإلى يساره، بحيث يبقى المؤشر عند الزاوية السفلية اليمنى ويظل النص ظاهرًا.
de: Platziert das HUD oberhalb und links vom Zeiger, sodass der Zeiger an der unteren rechten Ecke liegt und der Text sichtbar bleibt.
en: Places the HUD above and to the left of the pointer, with the pointer at its bottom-right corner so the text remains visible.
es: Coloca el indicador arriba y a la izquierda del puntero, con el puntero en la esquina inferior derecha para que el texto siga visible.
fr: Place l’indicateur au-dessus et à gauche du pointeur, avec le pointeur dans son coin inférieur droit pour que le texte reste visible.
ja: ポインタの左上に表示し、ポインタが右下隅に来るようにしてテキストを見やすくします。
ko: 포인터의 왼쪽 위에 표시하고 포인터가 오른쪽 아래 모서리에 오도록 하여 텍스트가 잘 보이게 합니다.
pt: Posiciona o indicador acima e à esquerda do cursor, com o cursor no canto inferior direito para manter o texto visível.
ru: Размещает индикатор выше и левее указателя, оставляя указатель в правом нижнем углу, чтобы текст был виден.
zh_hant: 將提示放在指標左上方，指標停在右下角，避免遮擋文字。

# settings.hud.position.at-pointer.selected-help
source: 提示显示时，下次点击会切换输入法，而不会点击下方内容。
ar: أثناء ظهور شاشة العرض، تؤدي نقرتك التالية إلى تبديل مصدر الإدخال بدلاً من النقر على المحتوى تحته.
de: Solange das HUD sichtbar ist, wechselt der nächste Klick die Eingabequelle, statt den darunterliegenden Inhalt anzuklicken.
en: While the HUD is visible, your next click switches the input source instead of clicking the content underneath.
es: Mientras el indicador esté visible, el siguiente clic cambiará la fuente de entrada en lugar de pulsar el contenido que hay debajo.
fr: Tant que l’indicateur est visible, votre prochain clic change la source de saisie au lieu de cliquer sur le contenu dessous.
ja: 表示中は、次のクリックで下のコンテンツを操作せずに入力ソースを切り替えます。
ko: 표시가 보이는 동안 다음 클릭은 아래 콘텐츠를 클릭하는 대신 입력 소스를 전환합니다.
pt: Enquanto o indicador estiver visível, o próximo clique alternará a fonte de entrada em vez de clicar no conteúdo abaixo.
ru: Пока индикатор виден, следующее нажатие переключит источник ввода вместо нажатия на содержимое под ним.
zh_hant: 提示顯示時，下次按一下會切換輸入法，而不會按一下下方內容。

# settings.hud.position.at-pointer.requires-interactive
source: 开启“交互式提示”后才能使用“指针处”。
ar: شغّل شاشة العرض التفاعلية لاستخدام «عند مؤشر الماوس».
de: Aktiviere das interaktive HUD, um „Am Zeiger“ zu verwenden.
en: Turn on Interactive HUD to use At Pointer.
es: Activa el indicador interactivo para usar «En el puntero».
fr: Activez l’indicateur interactif pour utiliser « Au pointeur ».
ja: 「ポインタの位置」を使用するには、操作可能な表示をオンにします。
ko: ‘포인터 위치’를 사용하려면 대화형 표시를 켜십시오.
pt: Ative o indicador interativo para usar “No cursor”.
ru: Включите интерактивный индикатор, чтобы использовать вариант «У указателя».
zh_hant: 開啟「互動式提示」後才能使用「指標處」。

# permission.accessibility.title
source: 辅助功能
ar: تسهيلات الاستخدام
de: Bedienungshilfen
en: Accessibility
es: Accesibilidad
fr: Accessibilité
ja: アクセシビリティ
ko: 손쉬운 사용
pt: Acessibilidade
ru: Универсальный доступ
zh_hant: 輔助使用

# permission.accessibility.description
source: 仅用于在当前文本输入区域和终端附近显示输入法。
ar: يُستخدم فقط لعرض مصدر الإدخال الحالي قرب مناطق إدخال النص والطرفيات النشطة.
de: Wird nur verwendet, um die aktuelle Eingabequelle neben aktiven Texteingabebereichen und Terminals anzuzeigen.
en: Used only to show the current input source near focused text input areas and terminals.
es: Solo se usa para mostrar la fuente de entrada actual junto a áreas de texto y terminales activos.
fr: Utilisé uniquement pour afficher la source de saisie actuelle près des zones de texte et terminaux actifs.
ja: フォーカス中のテキスト入力領域やターミナル付近に現在の入力ソースを表示するためにのみ使用します。
ko: 포커스된 텍스트 입력 영역과 터미널 근처에 현재 입력 소스를 표시하는 데만 사용됩니다.
pt: Usado apenas para mostrar a fonte de entrada atual perto de áreas de texto e terminais em foco.
ru: Используется только для показа текущего источника ввода рядом с активными областями ввода текста и терминалами.
zh_hant: 僅用於在目前文字輸入區域和終端機附近顯示輸入法。

# permission.accessibility.footnote
source: 在系统设置 → 隐私与安全性 → 辅助功能中允许 MacTools。自动切换输入法不受影响。
ar: اسمح لـ MacTools من إعدادات النظام ← الخصوصية والأمان ← تسهيلات الاستخدام. لا يتأثر التبديل التلقائي.
de: MacTools unter Systemeinstellungen → Datenschutz & Sicherheit → Bedienungshilfen erlauben. Der automatische Wechsel bleibt verfügbar.
en: Allow MacTools in System Settings → Privacy & Security → Accessibility. Automatic switching remains available.
es: Permite MacTools en Ajustes del Sistema → Privacidad y seguridad → Accesibilidad. El cambio automático sigue disponible.
fr: Autorisez MacTools dans Réglages Système → Confidentialité et sécurité → Accessibilité. Le changement automatique reste disponible.
ja: システム設定 → プライバシーとセキュリティ → アクセシビリティでMacToolsを許可してください。自動切り替えは引き続き利用できます。
ko: 시스템 설정 → 개인정보 보호 및 보안 → 손쉬운 사용에서 MacTools를 허용하세요. 자동 전환은 계속 사용할 수 있습니다.
pt: Permita o MacTools em Ajustes do Sistema → Privacidade e Segurança → Acessibilidade. A troca automática continua disponível.
ru: Разрешите MacTools в Системных настройках → Конфиденциальность и безопасность → Универсальный доступ. Автопереключение останется доступным.
zh_hant: 在系統設定 → 隱私權與安全性 → 輔助使用中允許 MacTools。自動切換輸入法不受影響。

# settings.memory.title
source: 自动记忆
ar: تذكّر مصدر الإدخال
de: Eingabequelle merken
en: Remember Input Source
es: Recordar fuente de entrada
fr: Mémoriser la source de saisie
ja: 入力ソースを記憶
ko: 입력 소스 기억
pt: Lembrar fonte de entrada
ru: Запоминать источник ввода
zh_hant: 自動記憶

# settings.memory.description
source: 切回应用时恢复上次使用的输入法。
ar: استعد آخر مصدر إدخال عند الرجوع إلى تطبيق.
de: Beim Zurückkehren zu einer App die zuletzt verwendete Eingabequelle wiederherstellen.
en: Restore the last input source when returning to an app.
es: Restaura la última fuente de entrada al volver a una app.
fr: Restaurez la dernière source de saisie lorsque vous revenez à une app.
ja: アプリに戻ったとき、最後に使用した入力ソースを復元します。
ko: 앱으로 돌아갈 때 마지막으로 사용한 입력 소스를 복원합니다.
pt: Restaure a última fonte de entrada ao voltar para um app.
ru: Восстанавливать последний источник ввода при возврате в приложение.
zh_hant: 切回應用程式時恢復上次使用的輸入法。

# settings.rules.title
source: 固定规则
ar: القواعد الثابتة
de: Feste Regeln
en: Fixed Rules
es: Reglas fijas
fr: Règles fixes
ja: 固定ルール
ko: 고정 규칙
pt: Regras fixas
ru: Фиксированные правила
zh_hant: 固定規則

# settings.rules.add
source: 添加
ar: إضافة
de: Hinzufügen
en: Add
es: Añadir
fr: Ajouter
ja: 追加
ko: 추가
pt: Adicionar
ru: Добавить
zh_hant: 加入
